---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewShadingSurfacesMode
source: html/8671224e-6208-eee9-a6f5-eab53207aad1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsEnergyAnalysisViewShadingSurfacesMode Property

"Show Shading Surfaces"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsEnergyAnalysisViewShadingSurfacesMode { get; }
```